Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_176-Vimalakirtinirdesa-v1.tmx
Source language: bo
Languages: en

source: ཆོས་ཀྱི་མཆོད་སྦྱིན་དེ་གང་གིས་སྔ་ཕྱི་མེད་པར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་འགྱུར་བ་དེ་ནི་ཆོས་ཀྱི་མཆོད་སྦྱིན་ནོ།
en: ‘A Dharma-sacrifice is that which develops living beings without beginning or end, giving gifts to them all simultaneously.

source: དམ་པའི་ཆོས་བསྡུས་པས་མངོན་པར་བསྒྲུབས་པའི་སྙིང་རྗེ་ཆེན་པོ་དང་།
en: of the great compassion consummated in the concentration of the holy Dharma on the liberation of all living beings;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་དགའ་བ་ལ་དམིགས་པས་མངོན་པར་བསྒྲུབས་པའི་དགའ་བ་ཆེན་པོ་དང་།
en: of the great joy consummated in the awareness of the supreme happiness of all living beings;

source: ཤེས་པས་བསྡུས་པས་མངོན་པར་བསྒྲུབས་པའི་བཏང་སྙོམས་ཆེན་པོ་དང་།
en: and of the great equanimity consummated in concentration through knowledge.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བསྟོད་པ།
en: They are praised by all the buddhas.

source: སེར་སྣ་ཅན་དང་། ཚུལ་ཁྲིམས་འཆལ་པ་དང་། གནོད་སེམས་ཅན་དང་། ལེ་ལོ་ཅན་དང་། བརྗེད་ངས་པ་དང་། ཤེས་རབ་འཆལ་པ་སྤ་འགོང་བ། ཕས་ཀྱི་རྒོལ་བ་དང་། ལྟ་བ་ངན་པ་དང་། དམིགས་པ་ལ་མངོན་པར་ཞེན་པ་ཐམས་ཅད་སྡངས་པར་བྱེད་པ།
en: They cause the abandonment of avarice, immorality, malice, laziness, forgetfulness, foolishness, and jealousy, as well as bad convictions, adherence to objects, and all opposition.

source: སེམས་ཅན་ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་པས་མངོན་པར་བསྒྲུབས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: and self-discipline; of the transcendence of morality, which is consummated in the moral development of immoral beings;

source: བྱང་ཆུབ་ཏུ་རྩོམ་པས་མངོན་པར་བསྒྲུབས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: of the transcendence of effort, consummated in initiative toward enlightenment;

source: བདག་མེད་པའི་ཆོས་ཀྱིས་མངོན་པར་བསྒྲུབས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: of the transcendence of tolerance, consummated through the principle of selflessness;

source: ལུས་དང་སེམས་དབེན་པས་མངོན་པར་བསྒྲུབས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: of the transcendence of meditation, consummated in the solitude of body and mind;

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱིས་མངོན་པར་བསྒྲུབས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: and of the transcendence of wisdom, consummated in the omniscient gnosis.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཉིད་ཇི་ལྟ་བ་བཞིན་དུ་ཁོང་དུ་ཆུད་པ།
en: realizing correctly the reality of the Buddha;

source: འདུས་བྱས་ཡོངས་སུ་སྦྱོང་བས་མངོན་པར་བསྒྲུབས་པའི་མཚན་མ་མེད་པ་ལ་སྒོམ་པ་དང་།
en: of the meditation of signlessness, consummated in the purification of all compounded things;

source: བསམས་བཞིན་དུ་སྐྱེ་བས་མངོན་པར་བསྒྲུབས་པའི་སྨོན་པ་མེད་པ་ལ་སྒོམ་པ་དང་།
en: and of the meditation of wishlessness, consummated in voluntarily assuming rebirths.

source: བསྡུ་བའི་དངོས་པོས་མངོན་པར་བསྒྲུབས་པའི་སྲོག་གི་དབང་པོ་དང་།
en: of the power of life, consummated in the means of unification;

source: ཆོས་ཉིད་ལ་རྟོན་གྱི་གང་ཟག་ཏུ་ལྟ་བ་དམིགས་པར་འཛིན་པ་ལ་མངོན་པར་མ་ཞེན་པ།
en: relying on reality and not insisting on opinions derived from personal authorities

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བྲན་དང་སློབ་མར་གྱུར་པས་མངོན་པར་བསྒྲུབས་པའི་ང་རྒྱལ་མེད་པ་དང་།
en: of the absence of pride, consummated in becoming the slave and the disciple of all living beings;

source: ངེས་པའི་དོན་གྱི་མདོ་སྡེ་ལ་རྟོན་གྱི་དྲང་བའི་དོན་ཀུན་རྫོབ་ལ་མངོན་པར་མ་ཞེན་པ།
en: relying on the ultimate teachings definitive in meaning and not insisting on the superficial teachings interpretable in meaning;

source: སྙིང་པོ་མེད་པ་ལས་སྙིང་པོ་ལེན་པས་མངོན་པར་བསྒྲུབས་པའི་ལུས་དང་། སྲོག་དང་། ལོངས་སྤྱོད་རྙེད་པ་དང་།
en: of the gain of body, health, and wealth, consummated by the extraction of essence from the essenceless;

source: ཡེ་ཤེས་ལ་རྟོན་གྱི་རྣམ་པར་ཤེས་པ་ལ་མི་རྟོན་པ།
en: relying on gnosis and not on consciousness;

source: དོན་ལ་རྟོན་གྱི་ཚིག་འབྲུ་ལ་མི་རྟོན་པ།
en: relying on the meaning and not on the literal expression;

source: ངར་འཛིན་པ་དང་བྲལ་བ།
en: being free of egoism;

source: ང་ཡི་བ་མེད་པ།
en: not being possessive;

source: འཐབ་པ་མེད་པ། རྩོད་པ་མེད་པ།
en: without quarreling or disputing;

source: རྒྱུ་དང་རྐྱེན་དང་མི་འགལ་བ་དང་།
en: refraining from struggle about causes and conditions,

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་རྣམས་ཀྱིས་རབ་ཏུ་བསྟོད་ཅིང་བསྔགས་པ།
en: They are approved and praised by the chiefs of the gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, and mahoragas.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོ་སྒྲུབ་པ། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ།
en: “ ‘They make possible the attainment of the seat of enlightenment and set in motion the wheel of the Dharma.

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་ཆོས་ཀྱི་མཆོད་པ་ནི་གང་ཆོས་ལ་ཆོས་སུ་ངེས་པར་སེམས་པ།
en: “ ‘Furthermore, noble son, the Dharma-worship consists of determining the Dharma according to the Dharma;

source: བདུད་ཀྱི་ལྟ་བར་གྱུར་པ་ཐམས་ཅད་མེད་པ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་བསྟན་པ།
en: They eliminate all the convictions of the māras, and they manifest relativity.

source: མི་དམིགས་པ་དང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་དང་ལྡན་པ།
en: They had attained the intuitive tolerance of the ultimate incomprehensibility and unborn nature of all things.

source: ཕྱིར་མི་ལྡོག་པའི་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བ།
en: They turned the irreversible wheel of the Dharma.

source: མཚན་ཉིད་མེད་པའི་ཕྱག་རྒྱས་བཏབ་པ།
en: They were stamped with the insignia of signlessness.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་ཤེས་པ་ལ་མཁས་པ།
en: They were expert in knowing the spiritual faculties of all living beings.

source: འཁོར་ཐམས་ཅད་ཀྱི་ཟིལ་གྱིས་མི་ནོན་པའི་མི་འཇིགས་པས་རྣམ་པར་གནོན་པ།
en: They were brave with the confidence that overawes all assemblies.

source: བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཆེན་པོ་བསགས་པ།
en: They had gathered the great stores of merit and of wisdom,

source: མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཐམས་ཅད་ཀྱིས་ལུས་ཤིན་ཏུ་བརྒྱན་པ།
en: were adorned with all the auspicious signs and marks.

source: གཟུགས་དམ་པ་འཛིན་པ། རྒྱན་དང་བྲལ་བ།
en: and their bodies, beautiful without ornaments,

source: རི་རབ་ཀྱི་རྩེ་མོ་མཐོ་བ་བཞིན་དུ་སྙན་པ་དང་གྲགས་པས་མངོན་པར་འཕགས་པ།
en: They were exalted in fame and glory, like the lofty summit of Mount Sumeru.

source: ལྷག་པའི་བསམ་པ་རྡོ་རྗེ་ལྟར་སྲ་བས་སངས་རྒྱས་དང་ཆོས་དང་དགེ་འདུན་ལ་མི་ཕྱེད་པའི་དད་པ་རྙེད་པ།
en: Their high resolve as hard as diamond, unbreakable in their faith in the Buddha, Dharma, and Saṅgha,

source: དམ་པའི་ཆོས་ཀུན་སྡུད་པ་དེ་ནི་ཆོས་ཀྱི་མཆོད་པ་ཞེས་བྱའོ།
en: thus incorporating into one’s own life the holy Dharma—that is “Dharma-worship.”

source: སེམས་ཅན་ལ་སྙིང་རྗེ་ཆེན་པོ་འཇུག་པ། བྱམས་པ་ཆེན་པོ་སྟོན་པ།
en: They introduce living beings to the great compassion and teach them the great love.

source: ཆོས་ཟབ་མོ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་འཇུག་ཅིང་
en: They had penetrated the profound principle of relativity and

source: མཐའ་དང་། མཐའ་མེད་པར་ལྟ་བའི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཀུན་གཅོད་པ་དང་།
en: had destroyed the persistence of the instinctual mental habits underlying all convictions concerning finitude and infinitude.

source: །རིགས་ཀྱི་བུ་འོག་གི་ཕྱོགས་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བཞི་བཅུ་རྩ་གཉིས་ཀྱི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དེ།
en: “Noble sons, the universe Sahā exists beyond as many buddhafields in the direction of the nadir as there are sands in forty-two Ganges rivers.

source: །ངེས་པ་ལ་ཞུགས་པ་གང་གིས་ཞལ་ཟས་འདི་ཟོས་པ་དེ་དག་སེམས་ཡོངས་སུ་མ་གྲོལ་གྱི་བར་དུ་མི་འཇུའོ།
en: When those who have entered destiny for the ultimate eat this food, it will not be digested until their minds are totally liberated.

source: དྲང་བ་དང་། ཞི་བ་དང་། ཕྲ་བ་དང་། འཇམ་པ་དང་། བལྟ་དཀའ་བ་དང་། རྟོགས་པར་དཀའ་བའི་ཆོས་ཀྱི་ཚུལ་ལ་མཁས་པ།
en: They were expert in the way of the Dharma, which is straight, peaceful, subtle, gentle, hard to see, and difficult to realize.

source: སེམས་ཅན་རྣམས་ཀྱི་འོང་བ་དང་། འགྲོ་བ་དང་། སེམས་ཅན་གྱི་བསམ་པ་རྟོགས་པའི་རྗེས་སུ་ཞུགས་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་དང་ལྡན་པ།
en: They were endowed with the wisdom that is able to understand the thoughts of living beings, as well as their comings and goings.

source: སེང་གེ་ལྟར་འཇིགས་པ་མེད་ཅིང་སྒྲ་མངོན་པར་སྒྲོགས་པ།
en: They spoke fearlessly, like lions,

source: ཆོས་ཆེན་པོའི་འབྲུག་སྒྲ་སྒྲོགས་པ།
en: sounding the thunder of the magnificent teaching.

source: མཚུངས་པ་དང་མི་མཚུངས་པའི་ཆོས་ལས་ཡང་དག་པར་འདས་པ།
en: Unequaled, they surpassed all measure.

source: ཆོས་རིན་པོ་ཆེའི་ཤེས་རབ་དང་བསོད་ནམས་ཀྱི་ཚོགས་ཡང་དག་པར་སྒྲུབ་པའི་དེད་དཔོན་ཆེན་པོ་
en: They were the best captains for the voyage of discovery of the treasures of the Dharma, the stores of merit and wisdom.

source: མི་མཉམ་པ་དང་མཉམ་པའི་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་དབང་བསྐུར་བས་དབང་བསྐུར་བ།
en: They had been consecrated with the anointment of the peerless gnosis of the Buddha.

source: །དེ་ལས་བཞི་ནི་སངས་རྒྱས་ལོག་པར་དད་སེལ་ལ་སོགས་པ་སྔོན་དུ་བྱུང་སྟེ།
en: Four of them, Krakucchanda and the others, have already appeared

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་དང་ལྡན་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བསྒྲུབ་པར་གཏོགས་པ།
en: They are endowed with all the aids to enlightenment and embody the seven factors of enlightenment.

source: །ཀུན་དགའ་བོ་ཚིག་དེ་གསུམ་གྱི་དོན་རྒྱས་པ་དང་། ཚིག་རྣམ་པར་དབྱེ་བ་གང་ཡིན་པ་དེ་ནི་ཁྱོད་ཚེའི་ཚད་བསྐལ་པར་འདུག་ཀྱང་བདེ་བར་ཀུན་ཆུབ་པར་སླ་བ་མ་ཡིན་ནོ།
en: “Ānanda, were your life to last an entire eon, it would not be easy for you to understand thoroughly the extensive meaning and precise verbal significance of these three names.

source: ལྷག་མ་རྣམས་ཀྱང་འབྱུང་བར་འགྱུར་རོ།
en: and the rest are still to be born.

source: བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ནང་དུ་གཏོགས་པ། གཟུངས་དང་མདོ་སྡེའི་རྒྱལ་པོའི་ཕྱག་རྒྱས་བཏབ་པ།
en: As sūtras, they are collected in the canon of the bodhisattvas, stamped with the insignia of the king of incantations and teachings.

source: འཇིག་རྟེན་ཐམས་ཅད་དང་མི་འཐུན་པ། རྟོགས་པར་དཀའ་བ། མངོན་པར་དཀའ་བ། ཁོང་དུ་ཆུད་པར་དཀའ་བ།
en: They do not conform to the mundane and are difficult to understand and difficult to see and difficult to realize.

source: །འཁོར་བ་འཇིག་ལ་སོགས་པ་སྣང་མཛད་ལ་ཐུག་པའི་བར་དུ་སྟེ། ཐ་མར་ནི་དེ་བཞིན་གཤེགས་པ་སྣང་མཛད་ཅེས་བྱ་བ་འབྱུང་ངོ་།
en: They start from Krakucchanda and end with the Tathāgata Roca, who will be the last to be born.

source: རིགས་ཀྱི་བུ་ཆོས་ཀྱི་མཆོད་པ་ནི་གང་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་མདོ་སྡེ་ཟབ་མོ་ཟབ་མོར་སྣང་བ།
en: ‘Noble son, Dharma-worship is that worship rendered to the discourses taught by the Tathāgata. These discourses are deep and profound in illumination.

source: །ལྷའི་དབང་པོ་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ། ལྷའི་དབང་པོ་ཇི་ཙམ་ན་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་མཆོད་པའི་ནང་ན་ཆོས་ཀྱི་མཆོད་པ་ནི་མཆོག་ཅེས་བྱའོ།
en: Thus, it is necessary to know, king of gods, that among all the worships rendered to the Tathāgata, Dharma-worship is the very best.

source: །མཆོག་དང་། དམ་པ་དང་། མཆོག་རབ་དང་། གྱ་ནོམ་པ་དང་། བླ་མ་དང་། བླ་ན་མེད་པ་ཞེས་བྱའོ།
en: Yes, it is good, eminent, excellent, perfect, supreme, and unexcelled.

source: །ལྷའི་དབང་པོ་དེ་ལྟ་བས་ནང་ལ་ཟང་ཟིང་གིས་མ་མཆོད་པར་ཆོས་ཀྱི་མཆོད་པས་མཆོད་ཅིག
en: And therefore, king of gods, do not worship me with material objects but worship me with Dharma-worship!

source: །ང་ལ་ཟང་ཟིང་གིས་བསྟི་སྟང་མ་བྱེད་ཆོས་ཀྱི་བསྟི་སྟང་གིས་རི་མོར་གྱིས་ཤིག
en: Do not honor me with material objects but honor me by honor to the Dharma!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་བཀའ་སྩལ་པ།
en: Then the Lord Śākyamuni said to the bodhisattva Maitreya, the great spiritual hero,

source: བྱམས་པ་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བསྐལ་པ་བྱེ་བ་གྲངས་མེད་པར་ཡང་དག་པར་བསྒྲུབས་པ་འདི་ཁྱོད་ལ་གཏད་དོ།
en: “I transmit to you, Maitreya, this unexcelled, perfect enlightenment which I attained only after innumerable millions of billions of eons,

source: །ཅི་ནས་ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་བུ་ཁྱོད་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཡོངས་སུ་བཟུང་བས་འཛམ་བུའི་གླིང་དུ་རྒྱས་པར་འགྱུར་ཞིང་མ་ནུབ་པར་གྱིས་ཤིག
en: in order that, at a later time, during a later life, a similar teaching of the Dharma, protected by your supernatural power, will spread in the world and will not disappear.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཐུགས་སུ་ཆུད་པ་རྣམས་ཀྱི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་སྣ་ཚོགས་སུ་སྟོན་པ་དེ་ནི་ངོ་མཚར་ཏོ།
en: Indeed, it is wonderful how all the lord buddhas, who understand the equality of all things, manifest all sorts of buddhafields in order to develop living beings!

source: །ཀུན་དགའ་བོ་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ཀྱི་ཡོན་ཏན་གཞན་དང་གཞན་དུ་སྣ་ཚོགས་སུ་འགྱུར་ཡང་བྱ་ལམ་གྱིས་ཁེབས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དང་ནམ་མཁའ་ལ་ཐ་དད་པ་མེད་པ་
en: “Ānanda, just as the buddhafields are diverse as to their specific qualities but have no difference as to the sky that covers them,

source: །ལྷའི་དབང་པོ་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ།
en: Thus it is taught, king of gods, and thus you must understand it.”

source: དེ་ཆོས་ཀྱིས་མཆོད་པར་ནུས་ཀྱི་ཟང་ཟིང་གིས་ནི་མ་ཡིན་པའི་ཕྱིར་རོ།
en: and one honors them by Dharma worship, and not by material worship.

source: ཡང་དག་པའི་དོན་གྱི་ཆོས་སོ་སོར་ཡང་དག་པར་རིག་པ་ལ་འཇུག་པ།
en: They induce the unmistaken understanding of the Dharma in its ultimate sense.

source: ལྷའི་དབང་པོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་ནི་ཆོས་ལས་བྱུང་སྟེ།
en: Because, king of gods, the enlightenment of the buddhas arises from the Dharma,

source: དེ་བཞིན་དུ་ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་གཟུགས་ཀྱི་སྐུ་ཐ་དད་དུ་འགྱུར་ཡང་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་ནི་ཐ་དད་པ་མ་ཡིན་ནོ།
en: so, Ānanda, the tathāgatas are diverse as to their physical bodies but do not differ as to their unimpeded gnosis.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: bowed down at his feet, circumambulated him to the right three times, and withdrew to one side.

source: །དེ་ནས་ལྷའི་དབང་པོ་རྒྱལ་བུ་ཟླ་གདུགས་གཞོན་ནུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྨན་གྱི་རྒྱལ་པོ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་།
en: ’“Then, the prince Candracchattra went to the Lord Bhaiṣajyarāja, the arhat, the Tathāgata, the unexcelled, perfectly enlightened one, and, having approached him,

source: བཅོམ་ལྡན་འདས་དེ་ཁྱོད་ལ་ལུང་སྟོན་ཏོ།
en: and he will explain it to you fully.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཆོད་རྟེན་སོ་སོར་བྱས་ནས་དེས་དེ་ལ་བསྐལ་པའམ། བསྐལ་པ་ལས་ལྷག་པར་མེ་ཏོག་ཐམས་ཅད་དང་། སྤོས་ཐམས་ཅད་དང་། རྒྱལ་མཚན་ཐམས་ཅད་དང་། བ་དན་ཐམས་ཅད་ཀྱིས་མཆོད་པ་བྱས་ཤིང་རྔ་དང་སིལ་སྙན་རྣམས་བརྡུངས་ཏེ་མཆོད་ན་
en: And let us suppose finally that, having erected all these stūpas for the tathāgatas, he or she were to devote an eon or more to offering them flowers, perfumes, banners, and standards, while playing drums and music.

source: འཕང་དུ་ནི་ཚངས་པའི་འཇིག་རྟེན་དུ་ཕྱིན་པ། གདུགས་དང་། བ་དན་དང་། སྲོག་ཤིང་བསྒྲེངས་པས་མཛེས་པར་རབ་ཏུ་བྱས་ཏེ།
en: rising as high as the world of Brahmā, adorned with parasols, banners, standards, and lamps.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བ་དང་། དམ་པའི་ཆོས་ལ་མཆོད་པ་བགྱི་བའི་སླད་དུ་བདག་དམ་པའི་ཆོས་ཡོངས་སུ་བསྲུང་བར་སྤྲོའོ།
en: ‘When the Tathāgata will be in ultimate liberation, I wish to defend his holy Dharma, to protect it, and to worship it.

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་བདག་གིས་བདུད་དང་ཕྱིར་རྒོལ་བ་རྣམས་བཅོམ་ནས་བཅོམ་ལྡན་འདས་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པར་འགྱུར་བ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་བྱིན་གྱི་བརླབ་པར་གསོལ།
en: May the Tathāgata grant me his supernatural blessing, that I may be able to conquer Māra and all adversaries and to incorporate in all my lives the holy Dharma of the Buddha!’“

source: །རྒྱལ་པོ་རིན་ཆེན་གདུགས་དེའི་བུ་སྟོང་ཡོད་པ་དེ་དག་ནི་ད་ལྟར་གྱི་བསྐལ་པ་བཟང་པོའི་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ཡིན་ཏེ།
en: As for the thousand sons of the King Ratnacchattra, they are now the thousand bodhisattvas of the present blessed eon,

source: དེ་བཞིན་གཤེགས་པས་དེའི་བསམ་པ་མཁྱེན་ནས་ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ་ན་དམ་པའི་ཆོས་ཀྱི་གྲོང་ཁྱེར་སྐྱོང་ཞིང་སྲུང་བ་དང་། ཡོངས་སུ་འཛིན་པར་འགྱུར་བར་ལུང་བསྟན་ཏོ།
en: The Tathāgata Bhaiṣajyarāja, knowing the high resolve of Candracchattra, prophesied to him that he would be, at a later time, in the future, the protector, guardian, and defender of the city of the holy Dharma.

source: །སེམས་ཅན་ཚད་མེད་པ་རྣམས་ནི་མཐོ་རིས་སུ་སྐྱེ་བར་བྱས་སོ།
en: and innumerable living beings took rebirth in the human and heavenly realms.

source: སྤོབས་པ་རྒྱུན་མི་འཆད་པ་སྦྱིན་པ་དང་། དུལ་བ་དང་། མི་འགྱུར་བ་དང་། ཡང་དག་པར་སྡོམ་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་དང་། ཐབས་ལ་མཁས་པ་དང་། སྨོན་ལམ་དང་། སྟོབས་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ངེས་པར་བྱུང་བ།
en: They were totally dedicated through the transcendences of generosity; subdued, unwavering, and sincere morality; tolerance; effort; meditation; wisdom; skill in liberative art; commitment; power; and gnosis.

source: ཆོས་རིན་པོ་ཆེའི་འོད་ཟེར་ལས་བདུད་རྩིའི་ཆར་ཤིན་ཏུ་འབེབས་པ།
en: they showered forth the rain of ambrosia that is released by the light rays of the jewel of the Dharma, which shines everywhere.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐད་དང་། སྨྲ་བ་དང་། དབྱངས་ཀྱི་ཡན་ལག་དང་། སྒྲ་རྣམ་པར་དག་པའི་དབྱངས་དང་ལྡན་པ།
en: Their voices were perfect in diction and resonance, and versatile in speaking all languages.

source: སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་མ་འདྲེས་པ་ལ་ལྷག་པའི་བསམ་པས་ཞུགས་པ།
en: With their high resolve, they approached the ten powers, the four fearlessnesses, and the eighteen special qualities of the Buddha.

source: ངན་སོང་གི་འཇིགས་པ་དང་། ངན་འགྲོའི་ལོག་པར་ལྟུང་བའི་འཇིགས་པའི་འོབས་ཐམས་ཅད་ལས་རྒལ་བས་བསམས་བཞིན་དུ་སྲིད་པའི་འགྲོ་བར་སྐྱེ་བ་སྟོན་པ།
en: They had crossed the terrifying abyss of the bad migrations, and yet they assumed reincarnation voluntarily in all migrations for the sake of disciplining living beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་ནད་ཐམས་ཅད་རྟོགས་པ།
en: understanding all the sicknesses of passions,

source: བྱང་ཆུབ་སེམས་དཔའ་མཉམ་པར་ལྟ་བ་ཞེས་བྱ་དང་། མཉམ་མི་མཉམ་ལྟ་བ་དང་། ཏིང་ངེ་འཛིན་རྣམ་པར་སྤྲུལ་པའི་རྒྱལ་པོ་དང་། ཆོས་ཀྱི་དབང་ཕྱུག་དང་། ཆོས་ཀྱི་ཏོག་དང་། འོད་ཀྱི་ཏོག་དང་། འོད་བཀོད་པ་དང་། རིན་པོ་ཆེ་བཀོད་པ་དང་། བཀོད་པ་ཆེན་པོ་དང་། སྤོབས་པ་བརྩེགས་པ་དང་། རིན་པོ་ཆེ་བརྩེགས་པ་དང་། ལག་ན་རིན་པོ་ཆེ་དང་། ལག་ན་ཕྱག་རྒྱ་རིན་པོ་ཆེ་དང་། རྟག་ཏུ་ལག་བརྐྱང་དང་། རྟག་ཏུ་ལག་བཏེག་དང་། རྟག་ཏུ་གདུང་དང་། རྟག་ཏུ་དགའ་དགོད་དབང་པོ་དང་། མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་དང་། ལྷའི་རྒྱལ་པོ་དང་། སྨོན་ལམ་ལ་ཞུགས་པས་ཕྱིན་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རབ་ཏུ་བསྒྲུབ་པ་ཐོབ་དང་། ནམ་མཁའི་མཛོད་དང་། རིན་ཆེན་སྒྲོན་མ་འཛིན་དང་། རིན་ཆེན་དཔའ་དང་། རིན་ཆེན་དགའ་བ་དང་། རིན་ཆེན་དཔལ་དང་། མིག་འཕྲུལ་ཅན་དང་། དྲ་བ་ཅན་གྱི་འོད་དང་། དམིགས་པ་མེད་པའི་བསམ་གཏན་དང་། ཤེས་རབ་བརྩེགས་དང་། རིན་ཆེན་གཏོང་དང་། བདུད་འཇོམས་དང་། གློག་གི་ལྷ་དང་། རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་དང་། མཚན་བརྩེགས་ཡང་དག་འདས་དང་། སེང་གེའི་ང་རོ་མངོན་པར་བསྒྲགས་པའི་དབྱངས་དང་། རིའི་རྩེ་མོ་ཀུན་ཏུ་འཇོམས་པའི་རྒྱལ་པོ་དང་། སྤོས་ཀྱི་གླང་པོ་ཆེ་དང་། སྤོས་ཀྱི་བ་གླང་གླང་པོ་ཆེ་དང་། རྟག་ཏུ་འབད་དང་། བརྩོན་པ་མི་འདོར་བ་དང་། རབ་ཀྱི་བློ་གྲོས་དང་། མཛེས་པར་སྐྱེས་དང་། པད་མོའི་དཔལ་གྱི་སྙིང་པོ་དང་། པད་མོ་བཀོད་པ་དང་། སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་དང་། མཐུ་ཆེན་ཐོབ་དང་། ཚངས་པའི་དྲ་བ་ཅན་དང་། རིན་ཆེན་གདན་དཀར་ཅན་དང་། བདུད་ལས་རྒྱལ་དང་། ཞིང་སྙོམས་བརྒྱན་དང་། ནོར་བུ་རིན་ཆེན་གདུགས་དང་། གཙུག་ན་གསེར་དང་། གཙུག་ན་ནོར་བུ་དང་། བྱམས་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སུམ་ཁྲི་ཉིས་སྟོང་ངོ་།
en: These bodhisattvas were named: Samadarśin, Sama­viṣama­darśin, Samādhi­vikurvaṇa­rāja, Dharmeśvara, Dharmaketu, Prabhāketu, Prabhāvyūha, Ratnavyūha, Mahāvyūha, Pratibhāna­kūṭa, Ratnakūṭa, Ratnapāṇi, Ratna­mudrā­hasta, Nityotkṣipta­hasta, Nityotpalakṛta­hasta, Nityotkaṇṭhita, Nitya­prahasita­pramuditendriya, Prāmodyarāja, Devarāja, Praṇidhi­prayāta­prāpta, Prati­saṃvit­praṇāda­prāpta, Gaganagañja, Ratnolkā­dhārin, Ratnavīra, Ratnananda, Ratnaśrī, Indrajāla, Jālinīprabha, Anārambaṇa­dhyāyin, Prajñākūta, Ratnajaha, Mārapramardin, Vidyuddeva, Vikurvaṇarāja, Lakṣaṇa­kūṭa­samatikrānta, Siṃha­ghoṣābhigarjita­śvara, Śaila­śikhara­saṃghaṭṭana­rāja, Gandhahastin, Gaja­gandha­hastin, Satatodyukta, Anikṣiptadhura, Sumati, Sujāta, Padmaśrī­garbha, Padmavyūha, Avalokiteśvara, Mahā­sthāma­prāpta, Brahmajāla, Ratnayaṣṭin, Mārajit, Kṣetralaṃkṛta, Maṇi­ratnacchattra, Suvarnacūḍa, Maṇicūḍa, Maitreya, Mañjuśrī­kumāra­bhūta, and so forth, with the remainder of the thirty-two thousand.

source: །གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་མྱ་ངན་མེད་པ་ནས་ཚངས་པ་རལ་པ་ཅན་ལ་སོགས་པ་ཚངས་པ་ཁྲི་བཅོམ་ལྡན་འདས་ལ་ལྟ་བ་དང་། ཕྱག་འཚལ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་ལྷགས་པ་དེ་དག་ཀྱང་འཁོར་དེ་ཉིད་དུ་འདུས་སོ།
en: There were also gathered there ten thousand Brahmās, at their head Brahmā Śikhin, who had come from the Aśoka universe with its four sectors to see, venerate, and serve the Buddha and to hear the Dharma from his own mouth.

source: །གླིང་ཆེན་པོ་བཞི་པ་སོ་སོ་ནས་ཀྱང་བརྒྱ་བྱིན་ཁྲི་ཉིས་སྟོང་ལྷགས་ཏེ།
en: There were twelve thousand Śakras from various four-sector universes.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལིད་ཙ་བཱི་གཞོན་ནུ་དཀོན་མཆོག་འབྱུང་གནས་ལིད་ཙ་བཱི་གཞོན་ནུ་ལྔ་བརྒྱ་ཙམ་དང་ལྷན་ཅིག་ཏུ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གདུགས་ཐོགས་ནས་ཡངས་པའི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་སྟེ། ཨ་མྲ་སྲུང་བའི་ཚལ་ག་ལ་བ་དང་།
en: Thereupon, the Licchavi bodhisattva Ratnākara, with five hundred Licchavi youths, each holding a precious parasol made of seven different kinds of jewels, came forth from the city of Vaiśālī and presented himself at the grove of Āmrapālī.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Each approached the Buddha, bowed at his feet,

source: བཅོམ་ལྡན་འདས་ལ་ལན་བདུན་བསྐོར་བ་བྱས་ནས།
en: circumambulated him clockwise seven times,

source: རིན་པོ་ཆེའི་གདུགས་ཇི་ལྟ་བུ་ཐོགས་པ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྐྱབས་ཏེ། མངོན་པར་བསྐྱབས་ནས་ཕྱོགས་གཅིག་འཁོད་དོ།
en: laid down his precious parasol in offering, and withdrew to one side.

source: །རིན་པོ་ཆེའི་གདུགས་དེ་དག་ཕུལ་མ་ཐག་ཏུ་དེའི་མོད་ལ་སངས་རྒྱས་ཀྱི་མཐུས་རིན་པོ་ཆེའི་གདུགས་དེ་དག་གཅིག་ཏུ་གྱུར་ཏེ།
en: As soon as all these precious parasols had been laid down, suddenly, by the miraculous power of the Lord, they were transformed into a single precious canopy

source: རིའི་རྒྱལ་པོ་རི་རབ་གང་དག་ཡོད་པ་རྣམས་དང་། གངས་རི་དང་། རི་བཏང་བཟུང་དང་། རི་བཏང་བཟུང་ཆེན་པོ་དང་། སྤོས་ཀྱི་ངད་ལྡན་དང་། རིན་པོ་ཆེའི་རི་དང་། རི་ནག་པོ་དང་། ཁོར་ཡུག་དང་། ཁོར་ཡུག་ཆེན་པོ་དང་།
en: the king of mountains, Mount Sumeru; Mount Himavat, Mount Mucilinda, Mount Mahāmucilinda, Mount Gandhamādana, Mount Ratnaparvata, Mount Kālaparvata, Mount Cakravāḍa, and Mount Mahācakravāḍa;

source: རྒྱ་མཚོ་ཆེན་པོ་གང་དག་ཡོད་པ་རྣམས་དང་། མཚོ་དང་། མཚེའུ་དང་། རྫིང་དང་། འབབ་ཆུ་དང་། ཆུ་བྲན་དང་། ལུ་མ་འབབ་པ་
en: all the great oceans, rivers, bays, torrents, streams, brooks, and springs; and

source: ཉི་མ་དང་ཟླ་བའི་གཞལ་མེད་ཁང་དང་། སྐར་མའི་གཟུགས་དང་། ལྷའི་གནས་དང་། ཀླུའི་གནས་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་གནས་རྣམས་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞིའི་གནས་དང་།
en: limitless mansions of suns, moons, and stellar bodies; the realms of the devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, and mahoragas, as well as the realms of the four Mahārājas;

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་
en: raised his hands, palms pressed together in salute of the Buddha,

source: བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: and praised him with the following hymn:

source: །དགེ་བའི་ལས་བསགས་ཡོན་ཏན་རྒྱ་མཚོ་དཔག་མི་ལང་།
en: Immeasurable is the ocean of your virtues, the accumulation of your good deeds.

source: །དགེ་སྦྱོང་ཞི་བའི་ལམ་བརྟེན་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: You affirm the path of peace. O Great Ascetic, obeisance to you!

source: །སྐྱེས་བུ་ཁྱུ་མཆོག་འདྲེན་པའི་རྫུ་འཕྲུལ་ཁྱོད་གཟིགས་ཤིག
en: Leader, bull of men, we behold the revelation of your miracle.

source: །ཁྱོད་ཀྱི་ཆོས་ཀྱི་རྒྱལ་སྲིད་མཆོག་འདི་ཆོས་ཀྱིས་རྒྱལ། །རྒྱལ་བས་འགྲོ་བ་རྣམས་ལ་ཆོས་ཀྱི་ནོར་ཀྱང་སྩལ།
en: Dharma-King, you rule with the Dharma your supreme Dharma-kingdom, And thereby bestow the treasures of the Dharma upon all living beings.

source: །འདི་ལ་བདག་མེད་ཚོར་བ་པོ་དང་བྱེད་མེད་ཅིང་། །དགེ་སྡིག་ལས་ཅིའང་ཆུད་མི་ཟ་ཞེས་གསུང་གིས་སྟོན།
en: Therein is neither ego, nor experiencer, nor doer, Yet no action, good or evil, loses its effects. Such is your teaching.

source: །ཐུབ་དབང་ཁྱོད་ཀྱིས་བདུད་དཔུང་སྟོབས་ཅན་རབ་བཏུལ་ནས།
en: O Śākyamuni, conquering the powerful host of Māra,

source: །བྱང་ཆུབ་མཆོག་རབ་ཞི་བ་མི་འཆི་བདེ་བ་བརྙེས།
en: You found peace, immortality, and the happiness of that supreme enlightenment
